package com.example.cancan

object KorData {

    val CHO = listOf(
        "ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ",
        "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"
    )

    val JUNG = listOf(
        "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ",
        "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"
    )

    val JONG = listOf(
        " ", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ",
        "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ",
        "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"
    )

    val JONG_DOUBLE = mapOf(
        "ㄲ" to "ㄱㄱ", "ㄳ" to "ㄱㅅ", "ㄵ" to "ㄴㅈ", "ㄶ" to "ㄴㅎ",
        "ㄺ" to "ㄹㄱ", "ㄻ" to "ㄹㅁ", "ㄼ" to "ㄹㅂ", "ㄽ" to "ㄹㅅ",
        "ㄾ" to "ㄹㅌ", "ㄿ" to "ㄹㅍ", "ㅀ" to "ㄹㅎ", "ㅄ" to "ㅂㅅ"
    )

}